; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v10 ?v3)
             (pred_1 ?v6 ?v11)
             (pred_3 ?v10 ?v11)
             (pred_10 ?v12 ?v10 )
	     (pred_6 ?v10)
             (pred_9 ?v4)
             (pred_12 ?v6)
             (pred_4 ?v11)
             (pred_2 ?v10)
             (pred_11 ?v6)
             (pred_5 ?v10)
             (pred_7 ))



(:action op_1
:parameters (?v13 ?v9 ?v1 ?v2)
:precondition (and (pred_9 ?v13) (pred_9 ?v9) (pred_12 ?v1) (pred_4 ?v2)
          (pred_8 ?v13 ?v9) (pred_1 ?v1 ?v2)
                   (pred_3 ?v9 ?v2) (pred_6 ?v13) 
                   (pred_2 ?v9) (pred_11 ?v1))
:effect (and  (pred_5 ?v9) (not (pred_2 ?v9))))


(:action op_5
:parameters (?v13 ?v8)
:precondition (and (pred_9 ?v13) (pred_9 ?v8)
               (pred_6 ?v13) (pred_8 ?v13 ?v8) (pred_5 ?v8))
:effect (and (pred_6 ?v8) (not (pred_6 ?v13))))

(:action op_2
:parameters (?v13 ?v1)
:precondition (and (pred_9 ?v13) (pred_12 ?v1) 
                  (pred_6 ?v13) (pred_10 ?v1 ?v13) (pred_7 ))
:effect (and (pred_11 ?v1)
   (not (pred_10 ?v1 ?v13)) (not (pred_7 ))))


(:action op_3
:parameters (?v13 ?v7 ?v5)
:precondition (and (pred_9 ?v13) (pred_12 ?v7) (pred_12 ?v5)
                  (pred_6 ?v13) (pred_11 ?v5) (pred_10 ?v7 ?v13))
:effect (and (pred_11 ?v7) (pred_10 ?v5 ?v13)
        (not (pred_11 ?v5)) (not (pred_10 ?v7 ?v13))))

(:action op_4
:parameters (?v13 ?v1)
:precondition (and (pred_9 ?v13) (pred_12 ?v1) 
                  (pred_6 ?v13) (pred_11 ?v1))
:effect (and (pred_7 ) (pred_10 ?v1 ?v13) (not (pred_11 ?v1)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_09 obj_21 obj_02 obj_06 obj_20 obj_12 obj_19 obj_03 obj_14 obj_07 obj_16 obj_11 obj_18 obj_15 obj_01
    obj_17 obj_05
    obj_13 obj_04 obj_10
    )

    (:init
       (pred_7)

       (pred_9 obj_08)
       (pred_9 obj_09)
       (pred_9 obj_21)
       (pred_9 obj_02)
       (pred_9 obj_06)
       (pred_9 obj_20)
       (pred_9 obj_12)
       (pred_9 obj_19)
       (pred_9 obj_03)
       (pred_9 obj_14)
       (pred_9 obj_07)
       (pred_9 obj_16)
       (pred_9 obj_11)
       (pred_9 obj_18)
       (pred_9 obj_15)
       (pred_9 obj_01)
       (pred_4 obj_17)
       (pred_4 obj_05)
       (pred_12 obj_13)
       (pred_12 obj_04)
       (pred_12 obj_10)

       (pred_8 obj_08 obj_06)
       (pred_8 obj_08 obj_09)
       (pred_8 obj_09 obj_20)
       (pred_8 obj_09 obj_21)
       (pred_8 obj_09 obj_08)
       (pred_8 obj_21 obj_12)
       (pred_8 obj_21 obj_02)
       (pred_8 obj_21 obj_09)
       (pred_8 obj_02 obj_19)
       (pred_8 obj_02 obj_21)
       (pred_8 obj_06 obj_03)
       (pred_8 obj_06 obj_20)
       (pred_8 obj_06 obj_08)
       (pred_8 obj_20 obj_14)
       (pred_8 obj_20 obj_12)
       (pred_8 obj_20 obj_09)
       (pred_8 obj_20 obj_06)
       (pred_8 obj_12 obj_07)
       (pred_8 obj_12 obj_19)
       (pred_8 obj_12 obj_21)
       (pred_8 obj_12 obj_20)
       (pred_8 obj_19 obj_16)
       (pred_8 obj_19 obj_02)
       (pred_8 obj_19 obj_12)
       (pred_8 obj_03 obj_11)
       (pred_8 obj_03 obj_14)
       (pred_8 obj_03 obj_06)
       (pred_8 obj_14 obj_18)
       (pred_8 obj_14 obj_07)
       (pred_8 obj_14 obj_20)
       (pred_8 obj_14 obj_03)
       (pred_8 obj_07 obj_15)
       (pred_8 obj_07 obj_16)
       (pred_8 obj_07 obj_12)
       (pred_8 obj_07 obj_14)
       (pred_8 obj_16 obj_01)
       (pred_8 obj_16 obj_19)
       (pred_8 obj_16 obj_07)
       (pred_8 obj_11 obj_18)
       (pred_8 obj_11 obj_03)
       (pred_8 obj_18 obj_15)
       (pred_8 obj_18 obj_14)
       (pred_8 obj_18 obj_11)
       (pred_8 obj_15 obj_01)
       (pred_8 obj_15 obj_07)
       (pred_8 obj_15 obj_18)
       (pred_8 obj_01 obj_16)
       (pred_8 obj_01 obj_15)
       (pred_2 obj_19)
       (pred_2 obj_11)
       (pred_2 obj_12)
       (pred_3  obj_19 obj_17)
       (pred_3  obj_11 obj_05)
       (pred_3  obj_12 obj_17)
       (pred_5 obj_08)
       (pred_5 obj_09)
       (pred_5 obj_21)
       (pred_5 obj_02)
       (pred_5 obj_06)
       (pred_5 obj_20)
       (pred_5 obj_03)
       (pred_5 obj_14)
       (pred_5 obj_07)
       (pred_5 obj_16)
       (pred_5 obj_18)
       (pred_5 obj_15)
       (pred_5 obj_01)

       (pred_1  obj_13 obj_17)
       (pred_1  obj_04 obj_05)
       (pred_1  obj_10 obj_05)
       (pred_10 obj_13 obj_09)
       (pred_10 obj_04 obj_18)
       (pred_10 obj_10 obj_21)
       (pred_6 obj_02)
    )

    (:goal (and
       (pred_10 obj_04 obj_11)
       (pred_10 obj_10 obj_03)
    ))
(:constraints
  (always (not (pred_6 obj_20)))
)
)

; plan
1. (op_5 obj_02 obj_21)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_21)
   goals met: 0 of 2
2. (op_2 obj_21 obj_10)
   deleted: (pred_10 obj_10 obj_21) (pred_7)
   added: (pred_11 obj_10)
   goals met: 0 of 2
3. (op_5 obj_21 obj_09)
   deleted: (pred_6 obj_21)
   added: (pred_6 obj_09)
   goals met: 0 of 2
4. (op_5 obj_09 obj_08)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_08)
   goals met: 0 of 2
5. (op_5 obj_08 obj_06)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_06)
   goals met: 0 of 2
6. (op_5 obj_06 obj_03)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_03)
   goals met: 0 of 2
7. (op_5 obj_03 obj_14)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_14)
   goals met: 0 of 2
8. (op_5 obj_14 obj_18)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_18)
   goals met: 0 of 2
9. (op_1 obj_18 obj_11 obj_10 obj_05)
   deleted: (pred_2 obj_11)
   added: (pred_5 obj_11)
   goals met: 0 of 2
10. (op_3 obj_18 obj_04 obj_10)
   deleted: (pred_11 obj_10) (pred_10 obj_04 obj_18)
   added: (pred_11 obj_04) (pred_10 obj_10 obj_18)
   goals met: 0 of 2
11. (op_5 obj_18 obj_11)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_11)
   goals met: 0 of 2
12. (op_4 obj_11 obj_04)
   deleted: (pred_11 obj_04)
   added: (pred_7) (pred_10 obj_04 obj_11)
   goals met: 1 of 2
13. (op_5 obj_11 obj_18)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_18)
   goals met: 1 of 2
14. (op_2 obj_18 obj_10)
   deleted: (pred_10 obj_10 obj_18) (pred_7)
   added: (pred_11 obj_10)
   goals met: 1 of 2
15. (op_5 obj_18 obj_14)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_14)
   goals met: 1 of 2
16. (op_5 obj_14 obj_03)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_03)
   goals met: 1 of 2
17. (op_4 obj_03 obj_10)
   deleted: (pred_11 obj_10)
   added: (pred_7) (pred_10 obj_10 obj_03)
   goals met: 2 of 2
